BuildRequestApp/target/classes/META-INF/spring/wsdl/attachmentWebService.wsdl

<wsdl:definitions xmlns="http://www.otr.ru/ufos/ws/core/facade/attachment/v1_1"
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:cc="http://www.otr.ru/ufos/ws/core/common/v1_1"
                  name="documentAttachmentsService"
                  targetNamespace="http://www.otr.ru/ufos/ws/core/facade/attachment/v1_1">
    <wsdl:types>
        <xsd:schema>
            <xsd:import namespace="http://www.otr.ru/ufos/ws/core/facade/attachment/v1_1" schemaLocation="attachmentWebService_v1_1?WSDL&interface=documentAttachmentsBinding&part=attachmentWebService_v1_1.xsd"/>
            <xsd:import namespace="http://www.otr.ru/ufos/ws/core/common/v1_1" schemaLocation="attachmentWebService_v1_1?WSDL&interface=documentAttachmentsBinding&part=attachmentWebService_v1_1_1.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="invalidGuidFault">
        <wsdl:part name="fault" element="cc:invalidGuidFault"></wsdl:part>
    </wsdl:message>
    <wsdl:message name="getAttachmentReqMsg">
        <wsdl:part name="parameters" element="getAttachmentRequest"></wsdl:part>
    </wsdl:message>
    <wsdl:message name="listAttachmentsReqMsg">
        <wsdl:part name="parameters" element="listAttachmentsRequest"></wsdl:part>
    </wsdl:message>
    <wsdl:message name="documentNotFoundFault">
        <wsdl:part name="fault" element="cc:documentNotFoundFault"></wsdl:part>
    </wsdl:message>
    <wsdl:message name="manageAttachmentsReqMsg">
        <wsdl:part name="parameters" element="manageAttachmentsRequest"></wsdl:part>
    </wsdl:message>
    <wsdl:message name="listAttachmentsRespMsg">
        <wsdl:part name="parameters" element="listAttachmentsResponse"></wsdl:part>
    </wsdl:message>
    <wsdl:message name="deletingAttachmentIsSignedFault">
        <wsdl:part name="fault" element="deletingAttachmentIsSignedFault"></wsdl:part>
    </wsdl:message>
    <wsdl:message name="getAttachmentRespMsg">
        <wsdl:part name="parameters" element="getAttachmentResponse"></wsdl:part>
    </wsdl:message>
    <wsdl:message name="manageAttachmentsRespMsg">
        <wsdl:part name="parameters" element="manageAttachmentsResponse"></wsdl:part>
    </wsdl:message>
    <wsdl:message name="attachmentNotFoundFault">
        <wsdl:part name="fault" element="attachmentNotFoundFault"></wsdl:part>
    </wsdl:message>
    <wsdl:portType name="documentAttachmentsPort">
        <wsdl:documentation>Сервис для работы с вложениями документа.</wsdl:documentation>
        <wsdl:operation name="listAttachments">
            <wsdl:documentation>Получение списка атрибутов вложений документа.</wsdl:documentation>
            <wsdl:input message="listAttachmentsReqMsg"></wsdl:input>
            <wsdl:output message="listAttachmentsRespMsg"></wsdl:output>
            <wsdl:fault name="documentNotFoundFault" message="documentNotFoundFault"></wsdl:fault>
            <wsdl:fault name="invalidGuidFault" message="invalidGuidFault"></wsdl:fault>
        </wsdl:operation>
        <wsdl:operation name="getAttachment">
            <wsdl:documentation>Получение содержимого вложения.</wsdl:documentation>
            <wsdl:input message="getAttachmentReqMsg"></wsdl:input>
            <wsdl:output message="getAttachmentRespMsg"></wsdl:output>
            <wsdl:fault name="invalidGuidFault" message="invalidGuidFault"></wsdl:fault>
            <wsdl:fault name="attachmentNotFoundFault" message="attachmentNotFoundFault"></wsdl:fault>
        </wsdl:operation>
        <wsdl:operation name="manageAttachments">
            <wsdl:documentation>
                Управление вложениями для указанного документа: создание и удаление.
            </wsdl:documentation>
            <wsdl:input message="manageAttachmentsReqMsg"></wsdl:input>
            <wsdl:output message="manageAttachmentsRespMsg"></wsdl:output>
            <wsdl:fault name="invalidGuidFault" message="invalidGuidFault"></wsdl:fault>
            <wsdl:fault name="deletingAttachmentIsSignedFault" message="deletingAttachmentIsSignedFault"></wsdl:fault>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="documentAttachmentsBinding" type="documentAttachmentsPort">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="listAttachments">
            <soap:operation soapAction=""/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
            <wsdl:fault name="documentNotFoundFault">
                <soap:fault name="documentNotFoundFault" use="literal"/>
            </wsdl:fault>
            <wsdl:fault name="invalidGuidFault">
                <soap:fault name="invalidGuidFault" use="literal"/>
            </wsdl:fault>
        </wsdl:operation>
        <wsdl:operation name="getAttachment">
            <soap:operation soapAction=""/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
            <wsdl:fault name="invalidGuidFault">
                <soap:fault name="invalidGuidFault" use="literal"/>
            </wsdl:fault>
            <wsdl:fault name="attachmentNotFoundFault">
                <soap:fault name="attachmentNotFoundFault" use="literal"/>
            </wsdl:fault>
        </wsdl:operation>
        <wsdl:operation name="manageAttachments">
            <soap:operation soapAction=""/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
            <wsdl:fault name="invalidGuidFault">
                <soap:fault name="invalidGuidFault" use="literal"/>
            </wsdl:fault>
            <wsdl:fault name="deletingAttachmentIsSignedFault">
                <soap:fault name="deletingAttachmentIsSignedFault" use="literal"/>
            </wsdl:fault>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="documentAttachmentsService">
        <wsdl:port name="documentAttachmentsPortv1_1" binding="documentAttachmentsBinding">
            <soap:address location="http://localhost:8080/sufdclient/web-services/attachmentWebService_v1_1"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>